# SpaceSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpaceSet Constructor
SpaceSet Class See Also
---
Initializes a new instance of the SpaceSet class
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpaceSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SpaceSet()
```

# See Also
SpaceSet Class
Autodesk.Revit.DB.Mechanical Namespace